tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1782_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1782_H_
#define _PIC16F1782_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define RC0                           53
#define PORTC                         54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTE                         62
#define RE3                           63
#define PIR1                          64
#define TMR1IF                        65
#define TMR2IF                        66
#define CCP1IF                        67
#define SSP1IF                        68
#define TXIF                          69
#define RCIF                          70
#define ADIF                          71
#define TMR1GIF                       72
#define PIR2                          73
#define CCP2IF                        74
#define C3IF                          75
#define BCL1IF                        76
#define EEIF                          77
#define C1IF                          78
#define C2IF                          79
#define OSFIF                         80
#define PIR4                          81
#define PSMC1SIF                      82
#define PSMC2SIF                      83
#define PSMC1TIF                      84
#define PSMC2TIF                      85
#define TMR0                          86
#define TMR1L                         87
#define TMR1H                         88
#define T1CON                         89
#define TMR1ON                        90
#define nT1SYNC                       91
#define T1OSCEN                       92
#define T1CKPS0                       93
#define T1CKPS                        94
#define T1CKPS1                       95
#define TMR1CS                        96
#define TMR1CS0                       97
#define TMR1CS1                       98
#define T1GCON                        99
#define T1GSS0                        100
#define T1GSS                         101
#define T1GSS1                        102
#define T1GVAL                        103
#define T1GGO                         104
#define T1GSPM                        105
#define T1GTM                         106
#define T1GPOL                        107
#define TMR1GE                        108
#define TMR2                          109
#define PR2                           110
#define T2CON                         111
#define T2CKPS0                       112
#define T2CKPS                        113
#define T2CKPS1                       114
#define TMR2ON                        115
#define T2OUTPS0                      116
#define T2OUTPS                       117
#define T2OUTPS1                      118
#define T2OUTPS2                      119
#define T2OUTPS3                      120
#define TRISA                         121
#define TRISA0                        122
#define TRISA1                        123
#define TRISA2                        124
#define TRISA3                        125
#define TRISA4                        126
#define TRISA5                        127
#define TRISA6                        128
#define TRISA7                        129
#define TRISB                         130
#define TRISB0                        131
#define TRISB1                        132
#define TRISB2                        133
#define TRISB3                        134
#define TRISB4                        135
#define TRISB5                        136
#define TRISB6                        137
#define TRISB7                        138
#define TRISC                         139
#define TRISC0                        140
#define TRISC1                        141
#define TRISC2                        142
#define TRISC3                        143
#define TRISC4                        144
#define TRISC5                        145
#define TRISC6                        146
#define TRISC7                        147
#define TRISE                         148
#define TRISE3                        149
#define PIE1                          150
#define TMR1IE                        151
#define TMR2IE                        152
#define CCP1IE                        153
#define SSP1IE                        154
#define TXIE                          155
#define RCIE                          156
#define ADIE                          157
#define TMR1GIE                       158
#define PIE2                          159
#define CCP2IE                        160
#define C3IE                          161
#define BCL1IE                        162
#define EEIE                          163
#define C1IE                          164
#define C2IE                          165
#define OSFIE                         166
#define PIE4                          167
#define PSMC1SIE                      168
#define PSMC2SIE                      169
#define PSMC1TIE                      170
#define PSMC2TIE                      171
#define OPTION_REG                    172
#define PS                            173
#define PS0                           174
#define PS1                           175
#define PS2                           176
#define PSA                           177
#define T0SE                          178
#define TMR0SE                        179
#define T0CS                          180
#define TMR0CS                        181
#define INTEDG                        182
#define nWPUEN                        183
#define PCON                          184
#define nBOR                          185
#define nPOR                          186
#define nRI                           187
#define nRMCLR                        188
#define nRWDT                         189
#define STKUNF                        190
#define STKOVF                        191
#define WDTCON                        192
#define SWDTEN                        193
#define WDTPS                         194
#define WDTPS0                        195
#define WDTPS1                        196
#define WDTPS2                        197
#define WDTPS3                        198
#define WDTPS4                        199
#define OSCTUNE                       200
#define TUN0                          201
#define TUN                           202
#define TUN1                          203
#define TUN2                          204
#define TUN3                          205
#define TUN4                          206
#define TUN5                          207
#define OSCCON                        208
#define SCS0                          209
#define SCS                           210
#define SCS1                          211
#define IRCF                          212
#define IRCF0                         213
#define IRCF1                         214
#define IRCF2                         215
#define IRCF3                         216
#define SPLLEN                        217
#define OSCSTAT                       218
#define HFIOFS                        219
#define LFIOFR                        220
#define MFIOFR                        221
#define HFIOFL                        222
#define HFIOFR                        223
#define OSTS                          224
#define PLLR                          225
#define T1OSCR                        226
#define ADRESL                        227
#define ADRESH                        228
#define ADCON0                        229
#define ADON                          230
#define GO_nDONE                      231
#define DONE                          232
#define GO                            233
#define ADGO                          234
#define CHS0                          235
#define CHS                           236
#define CHS1                          237
#define CHS2                          238
#define CHS3                          239
#define CHS4                          240
#define ADRMD                         241
#define ADCON1                        242
#define ADPREF0                       243
#define ADPREF                        244
#define ADPREF1                       245
#define ADNREF                        246
#define ADCS0                         247
#define ADCS                          248
#define ADCS1                         249
#define ADCS2                         250
#define ADFM                          251
#define ADCON2                        252
#define CHSN0                         253
#define CHSN                          254
#define CHSN1                         255
#define CHSN2                         256
#define CHSN3                         257
#define TRIGSEL                       258
#define TRIGSEL0                      259
#define TRIGSEL1                      260
#define TRIGSEL2                      261
#define TRIGSEL3                      262
#define LATA0                         263
#define LATA                          264
#define LATA1                         265
#define LATA2                         266
#define LATA3                         267
#define LATA4                         268
#define LATA5                         269
#define LATA6                         270
#define LATA7                         271
#define LATB0                         272
#define LATB                          273
#define LATB1                         274
#define LATB2                         275
#define LATB3                         276
#define LATB4                         277
#define LATB5                         278
#define LATB6                         279
#define LATB7                         280
#define LATC0                         281
#define LATC                          282
#define LATC1                         283
#define LATC2                         284
#define LATC3                         285
#define LATC4                         286
#define LATC5                         287
#define LATC6                         288
#define LATC7                         289
#define CM1CON0                       290
#define C1SYNC                        291
#define C1HYS                         292
#define C1SP                          293
#define C1ZLF                         294
#define C1POL                         295
#define C1OE                          296
#define C1OUT                         297
#define C1ON                          298
#define CM1CON1                       299
#define C1NCH0                        300
#define C1NCH                         301
#define C1NCH1                        302
#define C1NCH2                        303
#define C1PCH                         304
#define C1PCH0                        305
#define C1PCH1                        306
#define C1PCH2                        307
#define C1INTN                        308
#define C1INTP                        309
#define CM2CON0                       310
#define C2SYNC                        311
#define C2HYS                         312
#define C2SP                          313
#define C2ZLF                         314
#define C2POL                         315
#define C2OE                          316
#define C2OUT                         317
#define C2ON                          318
#define CM2CON1                       319
#define C2NCH0                        320
#define C2NCH                         321
#define C2NCH1                        322
#define C2NCH2                        323
#define C2PCH                         324
#define C2PCH0                        325
#define C2PCH1                        326
#define C2PCH2                        327
#define C2INTN                        328
#define C2INTP                        329
#define CMOUT                         330
#define MC1OUT                        331
#define MC2OUT                        332
#define MC3OUT                        333
#define BORCON                        334
#define BORRDY                        335
#define BORFS                         336
#define SBOREN                        337
#define FVRCON                        338
#define ADFVR0                        339
#define ADFVR                         340
#define ADFVR1                        341
#define CDAFVR0                       342
#define CDAFVR                        343
#define CDAFVR1                       344
#define TSRNG                         345
#define TSEN                          346
#define FVRRDY                        347
#define FVREN                         348
#define DACCON0                       349
#define DACNSS                        350
#define DACPSS                        351
#define DACPSS0                       352
#define DACPSS1                       353
#define DACOE2                        354
#define DACOE1                        355
#define DACEN                         356
#define DACCON1                       357
#define DACR0                         358
#define DACR                          359
#define DACR1                         360
#define DACR2                         361
#define DACR3                         362
#define DACR4                         363
#define DACR5                         364
#define DACR6                         365
#define DACR7                         366
#define APFCON                        367
#define CCP2SEL                       368
#define RXSEL                         369
#define TXSEL                         370
#define SDISEL                        371
#define SCKSEL                        372
#define SDOSEL                        373
#define CCP1SEL                       374
#define C2OUTSEL                      375
#define CM3CON0                       376
#define C3SYNC                        377
#define C3HYS                         378
#define C3SP                          379
#define C3ZLF                         380
#define C3POL                         381
#define C3OE                          382
#define C3OUT                         383
#define C3ON                          384
#define CM3CON1                       385
#define C3NCH                         386
#define C3NCH0                        387
#define C3NCH1                        388
#define C3NCH2                        389
#define C3PCH                         390
#define C3PCH0                        391
#define C3PCH1                        392
#define C3PCH2                        393
#define C3INTN                        394
#define C3INTP                        395
#define ANSA0                         396
#define ANSELA                        397
#define ANSA1                         398
#define ANSA2                         399
#define ANSA3                         400
#define ANSA4                         401
#define ANSA5                         402
#define ANSA7                         403
#define ANSB0                         404
#define ANSELB                        405
#define ANSB1                         406
#define ANSB2                         407
#define ANSB3                         408
#define ANSB4                         409
#define ANSB5                         410
#define EEADRL                        411
#define EEADRH                        412
#define EEDATL                        413
#define EEDATH                        414
#define EECON1                        415
#define RD                            416
#define WR                            417
#define WREN                          418
#define WRERR                         419
#define FREE                          420
#define LWLO                          421
#define CFGS                          422
#define EEPGD                         423
#define EECON2                        424
#define VREGCON                       425
#define VREGPM                        426
#define RC1REG                        427
#define TX1REG                        428
#define SP1BRGL                       429
#define SP1BRGH                       430
#define RC1STA                        431
#define RX9D                          432
#define OERR                          433
#define FERR                          434
#define ADDEN                         435
#define CREN                          436
#define SREN                          437
#define RX9                           438
#define SPEN                          439
#define TX1STA                        440
#define TX9D                          441
#define TRMT                          442
#define BRGH                          443
#define SENDB                         444
#define SYNC                          445
#define TXEN                          446
#define TX9                           447
#define CSRC                          448
#define BAUD1CON                      449
#define ABDEN                         450
#define WUE                           451
#define BRG16                         452
#define SCKP                          453
#define RCIDL                         454
#define ABDOVF                        455
#define WPUA0                         456
#define WPUA                          457
#define WPUA1                         458
#define WPUA2                         459
#define WPUA3                         460
#define WPUA4                         461
#define WPUA5                         462
#define WPUA6                         463
#define WPUA7                         464
#define WPUB0                         465
#define WPUB                          466
#define WPUB1                         467
#define WPUB2                         468
#define WPUB3                         469
#define WPUB4                         470
#define WPUB5                         471
#define WPUB6                         472
#define WPUB7                         473
#define WPUC0                         474
#define WPUC                          475
#define WPUC1                         476
#define WPUC2                         477
#define WPUC3                         478
#define WPUC4                         479
#define WPUC5                         480
#define WPUC6                         481
#define WPUC7                         482
#define WPUE                          483
#define WPUE3                         484
#define SSPBUF                        485
#define SSPADD                        486
#define SSPMSK                        487
#define SSPSTAT                       488
#define BF                            489
#define UA                            490
#define R_nW                          491
#define S                             492
#define P                             493
#define D_nA                          494
#define CKE                           495
#define SMP                           496
#define SSPCON1                       497
#define SSPM0                         498
#define SSPM                          499
#define SSPM1                         500
#define SSPM2                         501
#define SSPM3                         502
#define CKP                           503
#define SSPEN                         504
#define SSPOV                         505
#define WCOL                          506
#define SSPCON2                       507
#define SEN                           508
#define RSEN                          509
#define PEN                           510
#define RCEN                          511
#define ACKEN                         512
#define ACKDT                         513
#define ACKSTAT                       514
#define GCEN                          515
#define SSPCON3                       516
#define DHEN                          517
#define AHEN                          518
#define SBCDE                         519
#define SDAHT                         520
#define BOEN                          521
