tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1782_tdd.h
#define PSMC2DC4                      1091
#define PSMC2DC5                      1092
#define PSMC2DC6                      1093
#define PSMC2DC7                      1094
#define PSMC2DCH                      1095
#define PSMC2DC8                      1096
#define PSMC2DC9                      1097
#define PSMC2DC10                     1098
#define PSMC2DC11                     1099
#define PSMC2DC12                     1100
#define PSMC2DC13                     1101
#define PSMC2DC14                     1102
#define PSMC2DC15                     1103
#define PSMC2PRL                      1104
#define PSMC2PR0                      1105
#define PSMC2PR1                      1106
#define PSMC2PR2                      1107
#define PSMC2PR3                      1108
#define PSMC2PR4                      1109
#define PSMC2PR5                      1110
#define PSMC2PR6                      1111
#define PSMC2PR7                      1112
#define PSMC2PRH                      1113
#define PSMC2PR8                      1114
#define PSMC2PR9                      1115
#define PSMC2PR10                     1116
#define PSMC2PR11                     1117
#define PSMC2PR12                     1118
#define PSMC2PR13                     1119
#define PSMC2PR14                     1120
#define PSMC2PR15                     1121
#define PSMC2TMRL                     1122
#define PSMC2TMR0                     1123
#define PSMC2TMR1                     1124
#define PSMC2TMR2                     1125
#define PSMC2TMR3                     1126
#define PSMC2TMR4                     1127
#define PSMC2TMR5                     1128
#define PSMC2TMR6                     1129
#define PSMC2TMR7                     1130
#define PSMC2TMRH                     1131
#define PSMC2TMR8                     1132
#define PSMC2TMR9                     1133
#define PSMC2TMR10                    1134
#define PSMC2TMR11                    1135
#define PSMC2TMR12                    1136
#define PSMC2TMR13                    1137
#define PSMC2TMR14                    1138
#define PSMC2TMR15                    1139
#define PSMC2DBR                      1140
#define PSMC2DBR0                     1141
#define PSMC2DBR1                     1142
#define PSMC2DBR2                     1143
#define PSMC2DBR3                     1144
#define PSMC2DBR4                     1145
#define PSMC2DBR5                     1146
#define PSMC2DBR6                     1147
#define PSMC2DBR7                     1148
#define PSMC2DBF                      1149
#define PSMC2DBF0                     1150
#define PSMC2DBF1                     1151
#define PSMC2DBF2                     1152
#define PSMC2DBF3                     1153
#define PSMC2DBF4                     1154
#define PSMC2DBF5                     1155
#define PSMC2DBF6                     1156
#define PSMC2DBF7                     1157
#define PSMC2BLKR                     1158
#define PSMC2BLKR0                    1159
#define PSMC2BLKR1                    1160
#define PSMC2BLKR2                    1161
#define PSMC2BLKR3                    1162
#define PSMC2BLKR4                    1163
#define PSMC2BLKR5                    1164
#define PSMC2BLKR6                    1165
#define PSMC2BLKR7                    1166
#define PSMC2BLKF                     1167
#define PSMC2BLKF0                    1168
#define PSMC2BLKF1                    1169
#define PSMC2BLKF2                    1170
#define PSMC2BLKF3                    1171
#define PSMC2BLKF4                    1172
#define PSMC2BLKF5                    1173
#define PSMC2BLKF6                    1174
#define PSMC2BLKF7                    1175
#define PSMC2FFA                      1176
#define PSMC2FFA0                     1177
#define PSMC2FFA1                     1178
#define PSMC2FFA2                     1179
#define PSMC2FFA3                     1180
#define PSMC2STR0                     1181
#define P2STRA                        1182
#define P2STRB                        1183
#define PSMC2STR1                     1184
#define P2HSMEN                       1185
#define P2LSMEN                       1186
#define P2SSYNC                       1187
#define STATUS_SHAD                   1188
#define C_SHAD                        1189
#define DC_SHAD                       1190
#define Z_SHAD                        1191
#define WREG_SHAD                     1192
#define BSR_SHAD                      1193
#define PCLATH_SHAD                   1194
#define FSR0L_SHAD                    1195
#define FSR0H_SHAD                    1196
#define FSR1L_SHAD                    1197
#define FSR1H_SHAD                    1198
#define STKPTR                        1199
#define TOSL                          1200
#define TOSH                          1201

#endif // _PIC16F1782_H_
